#include<stdio.h>
// 正序分解一个数，输入一个非负整数，正序输出它的每一位数
int main(){

    // int x;
    // int lst;
    // int s=0;
    // int cnt=1;

    // printf("请输入想要分解的数:");
    // scanf("%d",&x);

    // while(x>0){
    // lst=x%10;//先取余
    // x=x/10;
    // s=s*10+lst;
    // if(s==0){
    //     cnt*=10;
    // }else{
    //     s*=cnt;
    //     }
    // }

    // do{
    // lst=s%10;//先取余
    // s=s/10;
    // printf("%d",lst);
    // if(s>0) printf(" "); 
    // }while(s>0);
    
    // 老师给的答案,从高位向低位走
    // 12345/10000------->1-----------1
    // 12345%10000------->2345
    // 2345/1000--------->2-----------2
    // 2345%1000--------->345
    // 345/100------------3-----------3
    // 345%100------------45
    // 45/10--------------4-----------4
    // 45%10--------------5
    // 5/10---------------0
    // 5%10---------------5------------5
    int x;
    scanf("%d",&x);

    int mask=1;
    int t=x;
    while(t>9){
        t/=10;
        mask*=10;
    }
    printf("x=%d,mask=%d\n",x,mask);
    do{
        int d= x/mask;
        printf("%d",d);
        if(mask>9){
            printf(" ");
        }
        x%=mask;
        mask/=10;
    }while(mask>0);

    printf("\n");
    return 0;
}
